Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus
Define possible statuses for geometry creation/modification commands.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.Success
Status on success creation.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.Failure
General failure mode.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.FacePerpendicularToIntersectionLine
Face perpendicular to intersection line.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.PlateIntersectsWithIntersectionLine
Plate polygon extends beyond intersection line.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.ExtensionIntersectsWithPlate
Extension plate clashes with plates.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.FacesTooNearEachOther
Faces to be connected overlap.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.FacesAtAnObtuseAngle
Faces to be connected are too steep of an angle.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.UndefinedCurveDirection
Can't make inward/outward curve check.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.UnsupportedChamfer
Plates containing unsupported chamfer information.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.InvalidRadius
Cannot connect parts with a cylindrical section having the provided radius.

Tekla.Structures.Model.BentPlateGeometrySolver.OperationStatus.InvalidFacePoints
Cannot create geometry from requested face points.